"""
Вид робіт	Дизайнери	Розробники	Тестувальники	Вартість послуги, тис $
Сайти	12 год	12 год	12 год	2
Інтернет-магазин	6 год	24 год	18 год	9
Інтеграція з ERP	2 год	18 год	12 год	6

Знайди, які послуги вигідніше надавати для максимізації прибутку. Для цього:

Сформуй цільову функцію доходу, виходячи з вартості послуг. За змінні візьми кількість робіт кожного виду.
Запиши систему обмежень, виходячи з умов. Не забудь врахувати час роботи спеціалістів за кожним видом робіт, місячне навантаження спеціалістів та неможливість від’ємних значень.
Знайди оптимальний розподіл послуг за допомогою бібліотеки SciPy так, як це робилось у конспекті.
Знайди сумарний місячний дохід компанії при оптимальному розподілі функцій. Зроби висновки.
"""
import numpy as np
from scipy.optimize import linprog

# Цільова функція
c = np.array([-2, -9, -6])  # не знаю, поміняв знаки щоб отримати хоть якийсь результат

# Обмеження
A = np.array([[12, 6, 2],
              [12, 24, 18],
              [12, 18, 12]])
b = np.array([160*2, 192, 180])

# Необхідність невід'ємних значень
bounds = [(0, float('inf')), (0, float('inf')), (0, float('inf'))]

# Вирішення за допомогою linprog
res = linprog(c, A, b, bounds=bounds)

# Оптимальні значення
x_opt = res.x
print("Оптимальний розподіл послуг:")
print("Кількість сайтів:", x_opt[0])
print("Кількість інтернет-магазинів:", x_opt[1])
print("Кількість інтеграцій з ERP:", x_opt[2])

# Максимальний дохід
max_profit = res.fun
print("Максимальний місячний дохід:", max_profit, "тис. грн.")
print('-'*50)
print(res)

# Висновок.
# Для максимізації прибутку компанія має робити тільки інтернет-магазини.
# Компанія може робити 8 інтернет-магазинів в місяць і в такому разі прибуток буде складати 72000 (і можна звільнити одного дизайнера)